% 推定したい状態量の(時間)微分方程式を推定状態量で微分した値を求める
function A  = delFdelX(xv,mu)
% % 初期化
% A = zeros(7);
% A(2,5) = 1; % 位置の微分は速度 
% A(3,6) = 1;
% A(4,7) = 1;
% R = (xv(1)^2+xv(2)^2+xv(3)^2)^0.5;
% 
% A(5,2) = -mu/R^3+3*mu*xv(1)^2/R^5; %uのx微分
% A(5,3) = 3*mu*xv(1)*xv(2)/R^5;     %uのy微分
% A(5,4) = 3*mu*xv(1)*xv(3)/R^5;     %uのz微分
% A(6,2) = 3*mu*xv(1)*xv(2)/R^5;     %vのx微分
% A(6,3) = -mu/R^3+3*mu*xv(2)^2/R^5; %vのy微分
% A(6,4) = 3*mu*xv(2)*xv(3)/R^5;     %vのz微分
% A(7,2) = 3*mu*xv(1)*xv(3)/R^5;     %wのx微分
% A(7,3) = 3*mu*xv(2)*xv(3)/R^5;     %wのy微分
% A(7,4) = -mu/R^3+3*mu*xv(3)^2/R^5; %wのz微分
% 


A = zeros(7,7);
R = xv(1:3);
[Ur,r] = unit(R);
g = mu./r.^2;
I = eye(3);
A(5:7,2:4) = -g./r*(I - 3*(Ur)*Ur');
A(2:4,5:7) = I;

% % % %% 計算一致しないので，-1/2倍する(これはたぶん良くないので基本コメントアウト)
% % % A(5:7,2:4) = A(5:7,2:4) * (-1/2);






end